// console.log("Hello ") //Вывод текста в консоль сайта 

// let string = "alloha" //Строковый тип данных
// //let - Неявное обьявление переменной
// //sting - Имя переменной
// // = -Это присвоение значения переменной
// alert(string)   //Всплывающее окно на сайте
// //"Relax" - Значение переменной

// let integer = 10//Численный тип данных
// let float  = 100.52//Число с плавающей точкой
// let boolean = true //= False

// ---------------------------------------------------------------------------------------------------------------


// let num = prompt("введите число для возведения в квадрат")
 // во внутрь переменной num мы передаем функцию prompt(),
 // которая принимает значение числа , вводимое из клавиатуры из браузера,
// которое в дальнейшем мы будем возводить в квадрат 

// num = num ** 2

// + сложения (num = num + 1) - значение переменной увеличивается на 1 
// - вычетание  (num = num - 1) - значение переменной уменьшится на 1 
// * умножение (num = num * 1) - ... умножится на 1 
//  / деление (num = num / 1) - ... делится на 1
//  % взятие остатка от деления (num = num % 3) - ... остаток от деления на 3


// мы изменили переменную num и возвели её значение в квадрат ( во втрубю степень)
// alert(num)
//  выводить значение переменной num на экран 

// ----------------------------------------------------------------------------------------------------------------

// let num_First = Number( prompt("введите первое число "))

// let num_Second = Number( prompt("введите второе число "))

// let mid = (num_First + num_Second) / 2


// alert(mid)

// -------------------------------------------------------------------------------------------------------------------



// let num = Number(prompt("введите сторону квадрата"))

// num = num ** 2

// alert (num)











